Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  return k_rx_ok;
}

/**
 * @brief Configure host SPI pins (RSPI2)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_host_spi(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_SPI";

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_copi);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 COPI pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cipo);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CIPO pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_sclk);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 SCLK pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cs0);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CS0 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure MTU encoder input pins (front wheels)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_mtu_encoders(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_MTU_ENC";

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKA pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKB pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKC pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKD pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure TPU encoder input pins (rear wheels)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_tpu_encoders(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_TPU_ENC";

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKA pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKB pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKC pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKD pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure GPTW PWM output pins (4 motors)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_gptw_pwm(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_GPTW";

  const rx_port_pin_t gptw_pins[] = {(rx_port_pin_t)k_pin_motor0_ph,
                                     (rx_port_pin_t)k_pin_motor0_en,
                                     (rx_port_pin_t)k_pin_motor1_ph,
                                     (rx_port_pin_t)k_pin_motor1_en,
                                     (rx_port_pin_t)k_pin_motor2_ph,
                                     (rx_port_pin_t)k_pin_motor2_en,
                                     (rx_port_pin_t)k_pin_motor3_ph,
                                     (rx_port_pin_t)k_pin_motor3_en};

  for (uint8_t i = 0; i < k_gptw_pin_count; i++) {
    err = rx_mpc_set_gptw(gptw_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "GPTW pin config failed");
  }

  return k_rx_ok;
}

/**
 * @brief Configure ADC current sense input pins
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_adc(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_ADC";

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an004);
  RX_RETURN_ON_ERROR(err, s_tag, "AN004 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an005);
  RX_RETURN_ON_ERROR(err, s_tag, "AN005 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an006);
  RX_RETURN_ON_ERROR(err, s_tag, "AN006 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an007);
  RX_RETURN_ON_ERROR(err, s_tag, "AN007 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure USB VBUS detection pin
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_usb(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_USB";

  err = rx_mpc_set_usb_vbus((rx_port_pin_t)k_pin_usb_vbus);
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure HC-SR04 sonar trigger pins (GPIO outputs)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_sonar_triggers(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_SONAR_TRIG";

  const rx_port_pin_t sonar_trig_pins[k_sonar_count] = {(rx_port_pin_t)k_pin_sonar_trig0,
                                                        (rx_port_pin_t)k_pin_sonar_trig1,
                                                        (rx_port_pin_t)k_pin_sonar_trig2,
                                                        (rx_port_pin_t)k_pin_sonar_trig3};

  for (uint8_t i = 0; i < k_sonar_count; i++) {
    err = rx_mpc_set_gpio(sonar_trig_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "Sonar trigger MPC config failed");

    const uint8_t            port = rx_port_from_pin(sonar_trig_pins[i]);
    const uint8_t            pin  = rx_pin_from_pin(sonar_trig_pins[i]);
    volatile rx_port_regs_t* regs = rx_port_get_base(port);
    RX_ASSERT(regs != nullptr, "Invalid sonar trigger port");
    regs->pmr &= ~(uint8_t)(1U << pin);
    regs->podr &= ~(uint8_t)(1U << pin);
    regs->pdr |= (uint8_t)(1U << pin);
  }

  return k_rx_ok;
}

/**
 * @brief Configure HC-SR04 sonar echo pins (GPIO inputs)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_sonar_echoes(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_SONAR_ECHO";

  const rx_port_pin_t sonar_echo_pins[k_sonar_count] = {(rx_port_pin_t)k_pin_sonar_echo0,
                                                        (rx_port_pin_t)k_pin_sonar_echo1,
                                                        (rx_port_pin_t)k_pin_sonar_echo2,
                                                        (rx_port_pin_t)k_pin_sonar_echo3};

