Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  for (uint8_t i = 0; i < k_sonar_count; i++) {
    err = rx_mpc_set_gpio(sonar_echo_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "Sonar echo MPC config failed");

    const uint8_t            port = rx_port_from_pin(sonar_echo_pins[i]);
    const uint8_t            pin  = rx_pin_from_pin(sonar_echo_pins[i]);
    volatile rx_port_regs_t* regs = rx_port_get_base(port);
    RX_ASSERT(regs != nullptr, "Invalid sonar echo port");
    regs->pmr &= ~(uint8_t)(1U << pin);
    regs->pdr &= ~(uint8_t)(1U << pin);
  }

  return k_rx_ok;
}

/**
 * @brief Configure DRV8243S chip select pins (GPIO outputs)
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_drv_cs(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_DRV_CS";

  const rx_port_pin_t drv_cs_pins[k_drv_cs_count] = {(rx_port_pin_t)k_pin_drv_cs0,
                                                     (rx_port_pin_t)k_pin_drv_cs1,
                                                     (rx_port_pin_t)k_pin_drv_cs2,
                                                     (rx_port_pin_t)k_pin_drv_cs3};

  for (uint8_t i = 0; i < k_drv_cs_count; i++) {
    err = rx_mpc_set_gpio(drv_cs_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "DRV CS MPC config failed");

    const uint8_t            port = rx_port_from_pin(drv_cs_pins[i]);
    const uint8_t            pin  = rx_pin_from_pin(drv_cs_pins[i]);
    volatile rx_port_regs_t* regs = rx_port_get_base(port);
    RX_ASSERT(regs != nullptr, "Invalid DRV CS port");
    regs->pmr &= ~(uint8_t)(1U << pin);
    regs->podr |= (uint8_t)(1U << pin);
    regs->pdr |= (uint8_t)(1U << pin);
  }

  return k_rx_ok;
}

/**
 * @brief Configure SCI7 SPI pins for motor driver communication
 * @return k_rx_ok on success, error code otherwise
 */
static rx_err_t internal_gpio_init_sci7_spi(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO_SCI7";

  err = rx_mpc_set_sci((rx_port_pin_t)k_pin_drv_sclk);
  RX_RETURN_ON_ERROR(err, s_tag, "SCI7 SCK pin config failed");

  err = rx_mpc_set_sci((rx_port_pin_t)k_pin_drv_copi);
  RX_RETURN_ON_ERROR(err, s_tag, "SCI7 COPI pin config failed");

  err = rx_mpc_set_sci((rx_port_pin_t)k_pin_drv_cipo);
  RX_RETURN_ON_ERROR(err, s_tag, "SCI7 CIPO pin config failed");

  return k_rx_ok;
}

static rx_err_t gpio_init(void)
{
  rx_err_t           err;
  static const char* s_tag = "GPIO";

  err = internal_gpio_init_i2c();
  RX_RETURN_ON_ERROR(err, s_tag, "I2C pin init failed");

  err = internal_gpio_init_host_spi();
  RX_RETURN_ON_ERROR(err, s_tag, "Host SPI pin init failed");

  err = internal_gpio_init_mtu_encoders();
  RX_RETURN_ON_ERROR(err, s_tag, "MTU encoder pin init failed");

  err = internal_gpio_init_tpu_encoders();
  RX_RETURN_ON_ERROR(err, s_tag, "TPU encoder pin init failed");

  err = internal_gpio_init_gptw_pwm();
  RX_RETURN_ON_ERROR(err, s_tag, "GPTW PWM pin init failed");

  err = internal_gpio_init_adc();
  RX_RETURN_ON_ERROR(err, s_tag, "ADC pin init failed");

  err = internal_gpio_init_usb();
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin init failed");

  err = internal_gpio_init_sonar_triggers();
  RX_RETURN_ON_ERROR(err, s_tag, "Sonar trigger pin init failed");

  err = internal_gpio_init_sonar_echoes();
  RX_RETURN_ON_ERROR(err, s_tag, "Sonar echo pin init failed");

  err = internal_gpio_init_drv_cs();
  RX_RETURN_ON_ERROR(err, s_tag, "DRV CS pin init failed");

  err = internal_gpio_init_sci7_spi();
  RX_RETURN_ON_ERROR(err, s_tag, "SCI7 SPI pin init failed");

  /* GTETRG nFAULT pins: no MPC config needed (documented in header) */

  rx_log_info(s_tag, "GPIO pin muxing complete");

  return k_rx_ok;
}

/**
 * @brief Initialize GPTW PWM for 4 motor channels with 90-degree phase staggering
 *
 * @details
 * Configures GPTW channels 0-3 for complementary PWM output at 20 kHz with
 * 1 µs dead-time. Channels are phase-staggered by 90 degrees to reduce peak
 * current draw and EMI.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 4 GPTW channels initialized successfully
 * @retval k_rx_err_hw_init_failed GPTW staggered init failed
 *
 * @pre GPIO pins for GPTW configured via gpio_init() (PSEL = 0x1E)
 * @pre PCLKA clock running at 120 MHz
 *
 * @post 4 GPTW channels configured for 20 kHz complementary PWM
 * @post Phase staggering active (0, 90, 180, 270 degrees)
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rx_gptw_init_all_staggered() HAL function for staggered PWM init
 *
 * @since Version 1.1.0
 */
static rx_err_t gptw_pwm_init(void)
{
  static const char* s_tag = "GPTW";

  rx_gptw_config_t config = {.frequency_hz         = k_gptw_pwm_freq_hz,
                             .deadtime_ns          = k_gptw_deadtime_ns,
                             .wave_mode            = k_gptw_wave_saw_pwm,
                             .enable_complementary = true,
                             .invert_polarity      = false};

  rx_err_t err = rx_gptw_init_all_staggered(&config);
  RX_RETURN_ON_ERROR(err, s_tag, "GPTW staggered init failed");

  rx_log_info(s_tag, "4 channels @ 20kHz, 90-deg stagger");
  return k_rx_ok;
}

/**
 * @brief Initialize RSPI2 as SPI peripheral for RPi5 host communication
 *
 * @details
 * Configures RSPI2 in peripheral mode for receiving commands from the
 * Raspberry Pi 5 host controller. Uses SPI mode 0 (CPOL=0, CPHA=0) with
 * 8-bit transfers.
 *
 * Motor driver SPI uses SCI7 (not RSPI) and is deferred since DRV8243 runs
 * in PH/EN mode (use_spi_variant = false).
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok RSPI2 peripheral initialized successfully
 * @retval k_rx_err_hw_init_failed RSPI2 init failed
 *
 * @pre GPIO pins for RSPI2 configured via gpio_init()
 * @pre PCLKA clock running
 *
 * @post RSPI2 ready to receive SPI transactions from RPi5
 * @post SPI mode 0, 8-bit transfers configured
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rspi_init_peripheral() HAL function for RSPI peripheral mode
 *
 * @since Version 1.1.0
 */
static rx_err_t spi_init(void)
{
  static const char* s_tag = "SPI";

  rspi_config_t host_config = {.spi_mode = k_rspi_mode_0, .use_16bit = false};

  rx_err_t err = rspi_init_peripheral(k_host_spi_channel, &host_config);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 peripheral init failed");

  rx_log_info(s_tag, "RSPI2 initialized (host peripheral, mode 0, 8-bit)");
  return k_rx_ok;
}

/**
 * @brief Initialize I2C buses for host communication and BMS
 *
 * @details
 * Configures two RIIC channels:
 * - **RIIC0** at 400 kHz (fast mode) for RPi5 host I2C
 * - **RIIC1** at 100 kHz (standard mode) for BQ4050 BMS communication
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Both RIIC channels initialized successfully
 * @retval k_rx_err_hw_init_failed RIIC init failed
 *
 * @pre GPIO pins for RIIC0/RIIC1 configured via gpio_init()
 * @pre PCLKB clock running at 60 MHz
 *
 * @post RIIC0 ready for host I2C at 400 kHz
 * @post RIIC1 ready for BMS I2C at 100 kHz
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see riic_init() HAL function for RIIC channel init
 *
 * @since Version 1.1.0
 */
static rx_err_t i2c_init(void)
{
  static const char* s_tag = "I2C";

