Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  riic_channel_t ch0 = {.value = k_i2c_channel_host};
  rx_err_t       err = riic_init(ch0, k_i2c_host_freq_hz);
  RX_RETURN_ON_ERROR(err, s_tag, "RIIC0 init failed");

  riic_channel_t ch1 = {.value = k_i2c_channel_bms};
  err                = riic_init(ch1, k_i2c_bms_freq_hz);
  RX_RETURN_ON_ERROR(err, s_tag, "RIIC1 init failed");

  rx_log_info(s_tag, "RIIC0 @ 400kHz, RIIC1 @ 100kHz");
  return k_rx_ok;
}

/**
 * @brief Initialize ADC channels for motor current sensing
 *
 * @details
 * Configures S12AD0 channels AN004-AN007 at 12-bit resolution for reading
 * motor current via DRV8243S IPROPI analog output.
 *
 * | Channel | Motor | Pin |
 * |---------|-------|-----|
 * | AN007 | Motor 0 | P4.7 |
 * | AN006 | Motor 1 | P4.6 |
 * | AN005 | Motor 2 | P4.5 |
 * | AN004 | Motor 3 | P4.4 |
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 4 ADC channels initialized
 * @retval k_rx_err_hw_init_failed ADC channel init failed
 *
 * @pre GPIO pins for ADC configured via gpio_init()
 * @pre PCLKB/PCLKD clock running
 *
 * @post S12AD0 channels AN004-AN007 ready for conversion
 * @post 12-bit resolution configured
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see adc_init() HAL function for ADC channel init
 *
 * @since Version 1.1.0
 */
static rx_err_t adc_init_channels(void)
{
  static const char* s_tag = "ADC";

  const adc_channel_t channels[k_motor_adc_count] = {
    k_adc_channel_7, /* Motor 0: AN007 */
    k_adc_channel_6, /* Motor 1: AN006 */
    k_adc_channel_5, /* Motor 2: AN005 */
    k_adc_channel_4  /* Motor 3: AN004 */
  };

  for (uint8_t i = 0; i < k_motor_adc_count; i++) {
    rx_err_t err = adc_init(k_adc_unit_0, channels[i], k_adc_resolution_12bit);
    RX_RETURN_ON_ERROR(err, s_tag, "ADC channel init failed");
  }

  rx_log_info(s_tag, "S12AD0 AN004-AN007 @ 12-bit");
  return k_rx_ok;
}

/**
 * @brief Non-fatal peripheral validation after initialization
 *
 * @details
 * Performs a test ADC conversion to verify the ADC subsystem is operational.
 * Logs warnings on failure but never halts - all checks are informational.
 *
 * @pre All peripheral init functions have completed
 *
 * @post Validation results logged
 * @post No state changes (read-only checks)
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 * @note Non-fatal: failures are logged as warnings, boot continues.
 *
 * @since Version 1.1.0
 */
static void validate_peripherals(void)
{
  static const char* s_tag = "VALIDATE";

  /* ADC test conversion on AN007 (motor 0 current) */
  uint16_t test_val = 0;
  if (adc_read(k_adc_unit_0, k_adc_channel_7, &test_val) == k_rx_ok) {
    rx_log_info(s_tag, "ADC0 test conversion OK");
  } else {
    rx_log_warn(s_tag, "ADC0 test conversion failed (non-fatal)");
  }

  rx_log_info(s_tag, "Peripheral validation complete");
}

/**
 * @brief Initialize all application-specific hardware peripherals for STAR motor controller
 *
 * @details
 * Configures **six categories** of peripherals required by the STAR robot application:
 *
 * 1. **GPIO** (planned) - Motor control pins, LEDs, sensor chip selects
 * 2. **Timers** ([PASS] implemented) - CMT0 for ThreadX tick at 1 kHz
 * 3. **UART** ([PASS] implemented) - SCI9 for debug console at 115200 baud
 * 4. **SPI** (planned) - Motor drivers (DRV8243), sensor bus
 * 5. **I2C** (planned) - IMU, temperature, pressure sensors
 * 6. **ADC** (planned) - Current sensing, battery voltage monitoring
 *
 * ## Initialization Sequence (6 Stages)
 *
 * **Stage order is CRITICAL** - violating dependencies causes failures:
 *
 * @msc
 * msc {
 *   width=700;
 *   Caller, HwInit, Timers, UART;
 *
 *   Caller => HwInit [label="hardware_init()"];
 *   HwInit note HwInit [label="Precondition: Check SCKCR3 != reset_state", textcolor="blue"];
 *   HwInit => HwInit [label="RX_ASSERT(clocks initialized)"];
 *   HwInit => Timers [label="timer_init()"];
 *   Timers => Timers [label="Configure CMT0\n1 kHz tick"];
 *   Timers => HwInit [label="k_rx_ok"];
 *   HwInit => UART [label="uart_debug_init()"];
 *   UART => UART [label="Configure SCI9\n115200 baud"];
 *   UART => HwInit [label="k_rx_ok"];
 *   HwInit note HwInit [label="Postcondition: Check SCKCR3 still valid", textcolor="green"];
 *   HwInit => HwInit [label="RX_ASSERT(clocks not corrupted)"];
 *   HwInit => Caller [label="k_rx_ok"];
 * }
 * @endmsc
 *
 * ## Performance Characteristics (RX72N @ 240 MHz)
 *
 * | Stage | Duration | CPU Cycles | Implementation | Critical Path? |
 * |-------|----------|------------|----------------|----------------|
 * | **Precondition check** | 0.5 µs | ~120 | [COMPLETE] | No |
 * | **Timer init (CMT0)** | 10 µs | ~2,400 | [COMPLETE] | No |
 * | **UART init (SCI9)** | 50 µs | ~12,000 | [COMPLETE] | No |
 * | **Postcondition check** | 0.5 µs | ~120 | [COMPLETE] | No |
 * | **Total (current)** | **~61 µs** | **~14,640** | Timers + UART only | **No** |
 *
 * **Note:** Not on critical boot path. Total boot time (main to ThreadX) is ~51 ms,
 * dominated by USB enumeration (~50 ms) which happens later in app_main_task.
 *
 * ## Memory Usage (Static Allocation Only)
 *
 * | Object | Size | Location | Lifetime |
 * |--------|------|----------|----------|
 * | **s_sckcr3_reset_state** | 1 byte | .rodata (Flash) | Permanent |
 * | **err (local variable)** | 2 bytes | Stack (Main stack) | Function duration |
 * | **Return address** | 4 bytes | Stack (Main stack) | Function duration |
 * | **Total stack usage** | ~64 bytes | Main stack (4 KB available) | Function duration |
 *
 * **Stack depth:** 1 level (hardware_init -> timer_init/uart_init)
 *
 * ## Error Handling and Recovery
 *
 * **Critical errors (assert-halt):**
 * - **Precondition:** SCKCR3 == reset_state -> Clocks not initialized (caller bug)
 * - **Postcondition:** SCKCR3 changed during init -> Clock corruption (peripheral bug)
 * - **Action:** RX_ASSERT halts execution with message
 *
 * **Peripheral errors (return error code):**
 * - **timer_init() failed** -> CMT0 configuration error (hardware or register access issue)
 * - **uart_debug_init() failed** -> SCI9 configuration error (baud rate calculation, pin config)
 * - **Action:** Return error to main(), which halts boot with error code
 *
 * **Recovery strategy:**
 * - On assert: Halt execution (developer investigates)
 * - On error return: main() halts boot (error logged via UART if possible)
 * - No partial initialization cleanup (fail-fast, no recovery)
 *
 * @return rx_err_t Initialization status
 * @retval k_rx_ok All peripherals initialized successfully
 * @retval k_rx_err_hw_init_failed Timer or UART initialization failed
 * @retval k_rx_err_timeout Peripheral configuration timeout (rare, indicates hardware fault)
 * @retval k_rx_err_invalid_state Peripheral already initialized or in unexpected state
 *
 * @pre System clocks configured via rx_clock_power_init() (SCKCR3 != reset_state)
 * @pre Interrupt vector table set up (reset vector, exception vectors)
 * @pre Stack pointer valid (at least 4 KB available in main stack)
 * @pre Memory protection unlocked if required (PRCR register)
 *
 * @post CMT0 configured for ThreadX tick at 1 kHz (timer interrupt enabled)
 * @post SCI9 configured for debug console at 115200 baud (UART TX/RX operational)
 * @post System clocks still operational (SCKCR3 unchanged from precondition)
 * @post Peripherals ready for application use (motor control, sensors, communication)
 *
 * @note **Call order:** rx_clock_power_init() -> hardware_init() -> tx_kernel_enter()
 *       Violating this order causes precondition assertion failure.
 *
 * @note **Not idempotent:** Calling hardware_init() multiple times may cause errors
 *       (peripherals already configured, interrupts already enabled). Only call once during boot.
 *
 * @warning **Never call before rx_clock_power_init().** Peripheral configuration requires
 *          stable system clocks. Precondition assertion will halt execution if violated.
 *
 * @warning **Boot order critical.** rx_infrastructure_init() must be called before
 *          hardware_init(). See main.c for the complete boot sequence.
 *
 * @par Thread Safety:
 * Executes in single-threaded context before ThreadX starts. No synchronization needed.
 *
 * @par Example Boot Sequence:
 * @code
 * int main(void) {
 *   rx_err_t ret;
 *
 *   // Stage 1: System clocks (240 MHz PLL)
 *   ret = rx_clock_power_init();
 *   RX_ERROR_CHECK(ret);
 *
 *   // Stage 2: Application peripherals (timers, UART, sensors)
 *   ret = hardware_init();
 *   if (ret != k_rx_ok) {
 *     // Log error (if UART initialized successfully)
 *     rx_log_error("MAIN", "Hardware initialization failed: %d", ret);
 *     // Halt boot
 *     while (1) { __asm__ volatile("wait"); }
 *   }
 *
 *   // Stage 3: Start ThreadX RTOS
 *   tx_kernel_enter();
 *
 *   // Never reached (scheduler takes over)
 * }
 * @endcode
 *
 * @par Example Error Handling:
 * @code
 * rx_err_t hardware_init(void) {
 *   rx_err_t err;
 *
 *   // Initialize timer (CMT0)
 *   err = timer_init();
 *   if (rx_err_is_error(err)) {
 *     // Cannot use rx_log_error yet (UART not initialized)
 *     return err;  // Propagate error to main()
 *   }
 *
 *   // Initialize UART (SCI9) - enables logging
 *   err = uart_debug_init();
 *   if (rx_err_is_error(err)) {
 *     // Still cannot log (UART init failed)
 *     return err;  // Propagate error to main()
 *   }
 *
 *   // Now logging is available for subsequent errors
 *   err = spi_init();
 *   if (rx_err_is_error(err)) {
 *     rx_log_error("HWINT", "SPI initialization failed: %d", err);
 *     return err;
 *   }
 *
 *   return k_rx_ok;
 * }
 * @endcode
 *
 * @par Planned Peripherals (Future Implementation):
 * - **GPIO:** Port initialization for motor control (PA0-PA7), LEDs (PB0-PB2), sensor CS (PC0-PC3)
 * - **SPI:** RSPI0 for motor drivers (DRV8243 × 4), RSPI1 for sensor bus
 * - **I2C:** RIIC0 for IMU (MPU6050), temperature (LM75), pressure (BMP280)
 * - **ADC:** ADC0 channels for current sensing (4 channels), battery voltage (1 channel)
 * - **USB:** USB CDC for ROS2 communication (already partially implemented, needs integration)
 *
 * @see rx_clock_power_init() System clock configuration (MUST call before this function)
 * @see timer_init() Configure CMT0 for ThreadX tick (called by this function)
 * @see uart_debug_init() Configure SCI9 for debug console (called by this function)
 * @see main() Main entry point (calls this function during boot)
 *
 * @since Version 1.0.0
 *
 * @test test_hardware_init.c Verify all peripherals initialize successfully
 * @test test_hardware_init.c Verify precondition assertion (clocks not initialized)
 * @test test_hardware_init.c Verify error propagation (timer/UART init failure)
 */
rx_err_t hardware_init(void)
{
  /* =========================================================================
   * PRECONDITION: Verify system initialization
   * =========================================================================
   */

  /* Precondition: Verify that system clocks have been initialized
   * Clock initialization must complete before peripheral setup */
  RX_ASSERT((system_regs() != nullptr) && (system_regs()->sckcr3 != s_sckcr3_reset_state),
            "Precondition: Clock system not properly initialized");

  /* =========================================================================
   * INITIALIZE PERIPHERALS
   *
   * Order: GPIO -> GPTW -> Timer -> UART -> SPI -> I2C -> ADC -> Validate
   * Later stages depend on earlier stages (GPIO must precede peripherals).
   * =========================================================================
   */

#if !RX_IS_SIMULATOR
  /* 1. GPIO: Configure MPC pin multiplexing for all peripherals */
  rx_err_t err = gpio_init();
  RX_RETURN_ON_ERROR(err, "HW_INIT", "GPIO initialization failed");

